=begin
    Функція отримає два параметри – цілі числа (жодне не дорівнює нулю, друге не повинно дорівнювати 1).
    Сформувати вираз у вигляді ax^k, де а буде результатом множення аргументів, а показник степеня – це число, на одиницю менше за другий аргумент.
    Наприклад, function4(4, 7) має повернути рядок 28x^6.
=end

    puts "Вкажіть перше ціле число (жодне не дорівнює нулю, друге не повинно дорівнювати 1): "
    a=gets.chomp
    a = a.to_i

    puts "Вкажіть друге ціле число (жодне не дорівнює нулю, друге не повинно дорівнювати 1): "
    b=gets.chomp
    b = b.to_i

    while a==0 || b==0 || b==1 do
            puts "Error | Спробуйте ще раз"
                puts "Вкажіть перше ціле число (жодне не дорівнює нулю, друге не повинно дорівнювати 1): "
                a=gets.chomp
                a = a.to_i

                puts "Вкажіть друге ціле число (жодне не дорівнює нулю, друге не повинно дорівнювати 1): "
                b=gets.chomp
                b = b.to_i
    end

    puts "Отримана функція: #{a*b}x^#{b-1}"
